src/main/resources/xml/accommodationFulfillmentServicePort/createServiceRequest/createServiceRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:createServiceRequest>
         <request>
            <travelPlanId>?</travelPlanId>
            <travelComponentId>?</travelComponentId>
            <travelComponentServiceRequestId>?</travelComponentServiceRequestId>
            <!--Optional:-->
            <locationId>?</locationId>
            <serviceRequestDetail>
               <!--Optional:-->
               <serviceType>?</serviceType>
               <!--Optional:-->
               <serviceRequestStatus>?</serviceRequestStatus>
               <!--Optional:-->
               <profileId>?</profileId>
               <!--Optional:-->
               <profileCode>?</profileCode>
               <!--Optional:-->
               <profileDescription>?</profileDescription>
               <!--Optional:-->
               <quantity>?</quantity>
               <!--Optional:-->
               <serviceDate>?</serviceDate>
               <!--Optional:-->
               <pickupDate>?</pickupDate>
               <!--Optional:-->
               <chargeAmount>
                  <currency>?</currency>
                  <amount>?</amount>
               </chargeAmount>
               <!--Optional:-->
               <isChargeWaived>?</isChargeWaived>
               <!--Optional:-->
               <chargeWaiveReason>?</chargeWaiveReason>
               <!--Optional:-->
               <specialInstruction>?</specialInstruction>
               <!--Optional:-->
               <facilityId>?</facilityId>
               <!--Optional:-->
               <roomNumber>?</roomNumber>
               <!--Optional:-->
               <requestedBy>?</requestedBy>
               <!--Zero or more repetitions:-->
               <workOrderList>?</workOrderList>
               <!--Optional:-->
               <serviceRequestId>?</serviceRequestId>
            </serviceRequestDetail>
            <!--Optional:-->
            <recurrenceDetail>
               <!--Optional:-->
               <recurrenceType>?</recurrenceType>
               <!--Optional:-->
               <startDate>?</startDate>
               <!--Optional:-->
               <endDate>?</endDate>
               <!--Optional:-->
               <recurrenceCount>?</recurrenceCount>
               <!--Optional:-->
               <intervalInDays>?</intervalInDays>
               <!--Optional:-->
               <intervalInWeeks>?</intervalInWeeks>
               <!--Optional:-->
               <isSunday>?</isSunday>
               <!--Optional:-->
               <isMonday>?</isMonday>
               <!--Optional:-->
               <isTuesday>?</isTuesday>
               <!--Optional:-->
               <isWednesday>?</isWednesday>
               <!--Optional:-->
               <isThursday>?</isThursday>
               <!--Optional:-->
               <isFriday>?</isFriday>
               <!--Optional:-->
               <isSaturday>?</isSaturday>
            </recurrenceDetail>
            <!--Optional:-->
            <createServiceRequest>?</createServiceRequest>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </acc:createServiceRequest>
   </soapenv:Body>
</soapenv:Envelope>
